'use client';
import React, { useState } from 'react';
import { Button } from '@/components/ui/Button';
import { Modal } from './Modal';

const Policies = () => {
  return (
    <>
      <div>Політика конфіденційності та захисту персональних даних</div>
      <div>
        Управління сайтом https://........... (далі – Сайт) здійснюється
        адміністратором сайту (далі за текстом разом іменуються – Виконавець).
        Ця Політика конфіденційності та захисту персональних даних (надалі –
        «Політика») є невід’ємною частиною публічного договору (публічної
        оферти) У цій Політиці визначено порядок здійснення Виконавцем
        оброблення персональних даних, види персональних даних, які збираються,
        цілі використання таких персональних даних, взаємодію Виконавця з
        третіми особами, заходи безпеки для захисту персональних даних, умови
        доступу до персональних даних, а також контактну інформацію для
        користувача щодо отримання доступу, внесення змін, блокування або
        видалення своїх персональних даних та звернення за будь-якими питаннями,
        які можуть виникнути у Замовника щодо практики захисту персональних
        даних. Збір та використання персональних даних Володільцем та
        розпорядником персональних даних Замовників (користувачів) Сайту є
        адміністратор сайту. Дані, які Виконавець отримує автоматично під час
        користування Сайтом. Виконавець не отримує автоматично жодних даних, за
        винятком даних, які містяться в файлах, про які йде мова нижче, під час
        самого користування Сайтом. Які дані отримує Виконавець при використанні
        сервісів Сайту. Виконавець отримуватиме у Замовника наступні персональні
        дані, за посередництвом Сайту, у випадку замовлення послуг чи здійснення
        платежів за наданні сервіси на Сайті, а саме: прізвище ім’я по батькові;
        адреса електронної пошти; номер телефону; файли cookie; IP-адреси.
        Отримання від Замовника (передача Замовником) наведених вище даних є
        добровільним та є рівними необхідним для здійснення платіжних транзакцій
        за використання сервісів Сайту та покупок в межах Сайту та/або для
        оформлення підписки на новини Сайту. Використання файлів cookie Cookie –
        це текстовий файл або файли, що містять невеликий обсяг інформації, які
        надсилаються веб-браузеру і зберігаються на пристрої користувача. До
        таких пристроїв можна віднести комп’ютер, мобільний телефон або інший
        пристрій, за допомогою якого користувач відвідує Сайт. Файли cookie
        можуть бути вічними (вони називаються постійними файлами cookie) і
        зберігатися в комп’ютері, поки користувач їх не видалить або тимчасовими
        (такі файли cookie називаються сесійними), тобто зберігаються тільки до
        закриття браузера. Крім того, файли cookie поділяються на основні (вони
        встановлюються безпосередньо відвідуваним Сайтом) і сторонні
        (встановлюються іншими веб-сайтами). Маркетинг Сайту Якщо Замовник надав
        згоду на підписку новин Сайту, вказана Замовником адреса електронної
        пошти використовуватиметься в маркетингових цілях власних продуктів
        Сайту. Згоду можна відмінити в будь-який момент. Розповсюдження
        інформації третім особам Виконавець Сайту не надає доступ до зібраних
        від Замовника персональних даних третім особам. Виконавець докладає всіх
        можливих зусиль, щоб захистити дані Замовників (користувачів) і
        охороняти їх від дій третіх осіб. Проте прийняті нами міри можуть
        виявитися недостатніми, якщо Замовники (користувачі) не
        дотримуватиметесь правил безпеки. Захист персональних даних Виконавець
        використовує загальноприйняті стандарти технологічного та операційного
        захисту інформації та персональних даних від втрати, неправильного
        використання, зміни або знищення, однак, не гарантує абсолютну
        захищеність від будь-яких загроз, що виникають поза межами регулювання
        Компанії.
      </div>
    </>
  );
};

export function ModalTestComponent() {
  const [isSuccessOpen, setIsSuccessOpen] = useState(false);
  const [isErrorOpen, setIsErrorOpen] = useState(false);
  const [isConditionsOpen, setIsConditionsOpen] = useState(false);

  const handleOpen = (type: 'conditions' | 'success' | 'error') => {
    document.body.style.overflow = 'hidden';
    switch (type) {
      case 'conditions':
        setIsConditionsOpen(true);
        return;
      case 'success':
        setIsSuccessOpen(true);
        return;
      case 'error':
        setIsErrorOpen(true);
        return;
    }
  };

  const handleClose = (type: 'conditions' | 'success' | 'error') => {
    document.body.style.overflow = 'auto';
    switch (type) {
      case 'conditions':
        setIsConditionsOpen(false);
        return;
      case 'success':
        setIsSuccessOpen(false);
        return;
      case 'error':
        setIsErrorOpen(false);
        return;
    }
  };

  return (
    <div className="outline-dashed">
      <button className="mr-5 bg-accent" onClick={() => handleOpen('success')}>
        SUCCESS
      </button>
      <button className="mr-5 bg-accent" onClick={() => handleOpen('error')}>
        ERROR
      </button>
      <button
        className="mr-5 bg-accent"
        onClick={() => handleOpen('conditions')}
      >
        CONDITIONS
      </button>

      {isSuccessOpen && (
        <Modal onClose={() => handleClose('success')} type="success" />
      )}
      {isErrorOpen && (
        <Modal onClose={() => handleClose('error')} type="error" />
      )}
      {isConditionsOpen && (
        <Modal onClose={() => handleClose('conditions')} type="conditions">
          <Policies />
        </Modal>
      )}
    </div>
  );
}
